---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnTooLong
source: html/37de82ae-6f1f-8ee1-ecfc-5d14642d373d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.ColumnTooLong Property

This column is too long. Maximum length is 30,000 ft.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnTooLong { get; }
```